#### Terraform Plan 📖
✅ **Plan succeeded**

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.lambda_logs will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/boston-opendata-mcp-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Environment"          = "development"
          + "ManagedBy"            = "Terraform"
          + "Project"              = "Boston-Core-MCP"
          + "launchpad-experiment" = "true"
        }
      + tags_all          = {
          + "Environment"          = "development"
          + "ManagedBy"            = "Terraform"
          + "Project"              = "Boston-Core-MCP"
          + "launchpad-experiment" = "true"
        }
    }

  # aws_ecr_lifecycle_policy.boston_opendata_mcp will be created
  + resource "aws_ecr_lifecycle_policy" "boston_opendata_mcp" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "boston-opendata-mcp-dev"
    }

  # aws_ecr_repository.boston_opendata_mcp will be created
  + resource "aws_ecr_repository" "boston_opendata_mcp" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "boston-opendata-mcp-dev"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment"          = "development"
          + "ManagedBy"            = "Terraform"
          + "Project"              = "Boston-Core-MCP"
          + "launchpad-experiment" = "true"
        }
      + tags_all             = {
          + "Environment"          = "development"
          + "ManagedBy"            = "Terraform"
          + "Project"              = "Boston-Core-MCP"
          + "launchpad-experiment" = "true"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_iam_role.lambda_execution will be created
  + resource "aws_iam_role" "lambda_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "boston-opendata-mcp-dev-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment"          = "development"
          + "ManagedBy"            = "Terraform"
          + "Project"              = "Boston-Core-MCP"
          + "launchpad-experiment" = "true"
        }
      + tags_all              = {
          + "Environment"          = "development"
          + "ManagedBy"            = "Terraform"
          + "Project"              = "Boston-Core-MCP"
          + "launchpad-experiment" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.lambda_logs will be created
  + resource "aws_iam_role_policy" "lambda_logs" {
      + id          = (known after apply)
      + name        = "boston-opendata-mcp-dev-logs-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:us-east-1:530075910224:log-group:/aws/lambda/boston-opendata-mcp-dev:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "boston-opendata-mcp-dev-execution-role"
    }

  # aws_lambda_function.boston_opendata_mcp will be created
  + resource "aws_lambda_function" "boston_opendata_mcp" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "boston-opendata-mcp-dev"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"          = "development"
          + "ManagedBy"            = "Terraform"
          + "Project"              = "Boston-Core-MCP"
          + "launchpad-experiment" = "true"
        }
      + tags_all                       = {
          + "Environment"          = "development"
          + "ManagedBy"            = "Terraform"
          + "Project"              = "Boston-Core-MCP"
          + "launchpad-experiment" = "true"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + logging_config {
          + application_log_level = (known after apply)
          + log_format            = (known after apply)
          + log_group             = (known after apply)
          + system_log_level      = (known after apply)
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function_url.boston_opendata_mcp will be created
  + resource "aws_lambda_function_url" "boston_opendata_mcp" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "boston-opendata-mcp-dev"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)

      + cors {
          + allow_credentials = false
          + allow_headers     = [
              + "*",
            ]
          + allow_methods     = [
              + "*",
            ]
          + allow_origins     = [
              + "*",
            ]
          + max_age           = 86400
        }
    }

  # null_resource.docker_build_and_push will be created
  + resource "null_resource" "docker_build_and_push" {
      + id       = (known after apply)
      + triggers = {
          + "architecture"       = "arm64"
          + "dockerfile_hash"    = "a77549d3a4e509d5797c31b4b4412e91"
          + "lambda_server_hash" = "1e4037aea1f6ce63ba8eeb5ea9555a4b"
          + "logger_hash"        = "d6483076f8a080d6e21f76b9cb184ac3"
          + "repository_url"     = (known after apply)
          + "requirements_hash"  = "3c40c3778986a13ec6395af91c700e62"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_region           = "us-east-1"
  + cloudwatch_log_group = "/aws/lambda/boston-opendata-mcp-dev"
  + deployment_commands  = {
      + build_image     = "docker build --platform=linux/arm64 --provenance=false -t boston-opendata-mcp-dev:latest -f servers/boston_opendata_lambda/Dockerfile ."
      + login_ecr       = (known after apply)
      + push_image      = (known after apply)
      + tag_image       = (known after apply)
      + update_function = (known after apply)
    }
  + ecr_repository_url   = (known after apply)
  + function_url         = (known after apply)
  + lambda_function_arn  = (known after apply)
  + lambda_function_name = "boston-opendata-mcp-dev"
  + lambda_role_arn      = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @thealphacubicle, Action: `pull_request`*